upsfall2011@saucers.cups.cs.cmu.edu/tmp/app/controllers/home_controller.rb

SELECT * FROM "posts" WHERE (sms_body = 'Welcome to Twilio SMS. Configure your number''s SMS URL to change this message.
SELECT * FROM "users" WHERE (phone_number = '+13303603395') LIMIT 1
SELECT * FROM "users"
---
  def index
    # Hack...there may be a better way to do this but whatever
    # Saves posts sent by one of the forms
    if (params[:post] != nil && params[:postid] != nil)
      post = Post.find(params[:postid])
      post.update_attributes(params[:post])
      Rails::logger.debug 'Update post parameter:' << params[:post][:sms_body].to_s << ''
      post.update_completed
    end

    @users = User.find(:all)

    userID = params[:id]
    if userID == nil
      Rails::logger.debug '@userID param is nil'
      redirect_to users_url
    else
      Rails::logger.debug '@userID param is ' << userID
      @user = User.find_by_link(params[:id])
      datePosts = params[:date]
      if datePosts == nil
        Rails::logger.debug 'datePosts param is nil'
        dateStrings = @user.posts.map {|post| post.sms_date.strftime('%Y/%m/%d')}.uniq