ffgsite/app/controllers/home_controller.rb

  def index
    # Hack...there may be a better way to do this but whatever
    # Saves posts sent by one of the forms
    if (params[:post] != nil && params[:postid] != nil)
      post = Post.find(params[:postid])
      post.update_attributes(params[:post])
      Rails::logger.debug 'Update post parameter:' << params[:post][:sms_body].to_s << ''
      post.update_completed
    end

    @users = User.find(:all)

    userID = params[:id]
    if userID == nil
      Rails::logger.debug '@userID param is nil'
      redirect_to users_url
    else
      Rails::logger.debug '@userID param is ' << userID
      @user = User.find_by_link(params[:id])
      datePosts = params[:date]
      if datePosts == nil
        Rails::logger.debug 'datePosts param is nil'
        dateStrings = @user.posts.map {|post| post.sms_date.strftime('%Y/%m/%d')}.uniq
---
SELECT * FROM "posts" WHERE (sms_body = 'Welcome to Twilio SMS. Configure your number''s SMS URL to change this message.
UPDATE "posts" SET "updated_at" = '2011-11-01 23:37:27', "p1" = 'test', "p5" = 'test', "p4" = 'test', "p3" = 'test', "p2" = 'test' WHERE "id" = 5
INSERT INTO "posts" ("p1", "created_at", "sms_date", "p2", "completed", "p3", "updated_at", "p4", "np1", "p5", "np2", "user_id", "np3", "nn1", "type", "nn2", "sms_body") VALUES(NULL, '2011-11-02 01:15:07', '2011-11-01 22:33:31', NULL, NULL, NULL, '2011-11-02 01:15:07', NULL, NULL, NULL, NULL, 1, NULL, NULL, 'p', NULL, 'Welcome to Twilio SMS. Configure your number''s SMS URL to change this message.
SELECT * FROM "users" WHERE (phone_number = '+14123574034') LIMIT 1
INSERT INTO "users" ("name", "phone_number", "link", "email", "created_at", "updated_at") VALUES(NULL, '+19199950334', '5b0a362a998f6a4cc27a368cbc7618c9', NULL, '2011-11-02 18:07:45', '2011-11-02 18:07:45')
SELECT * FROM "users" WHERE ("users"."link" = '345230dfe0459bc87169c6e9088fdb0b') LIMIT 1
SELECT * FROM "posts"
SELECT * FROM "users"