ffgsite/app/controllers/posts_controller.rb

SELECT * FROM "users" WHERE ("users"."link" = '345230dfe0459bc87169c6e9088fdb0b') LIMIT 1
SELECT * FROM "posts" WHERE ("posts"."id" = 9)
INSERT INTO "posts" ("kind", "p1", "created_at", "sms_date", "p2", "completed", "p3", "updated_at", "p4", "np1", "p5", "np2", "user_id", "np3", "nn1", "nn2", "sms_body") VALUES('np', NULL, '2011-11-02 01:19:47', '2011-10-30 00:00:00', NULL, NULL, NULL, '2011-11-02 01:19:47', NULL, NULL, NULL, NULL, 1, NULL, NULL, NULL, '[Blank]')
---
  def index
    @user = User.find_by_link(params[:id])
    @type = params[:type]
    if @user != nil && @type != nil
      @create = params[:uc]
      if @create.casecmp("u") == 0
        @post = Post.find(params[:postid])
      else
        @post = Post.new do |p|
          dateSplit = params[:date].split("/")
          Rails::logger.debug params[:date]
          dateSplit.each do |split| Rails::logger.debug '' + split end
          p.sms_date = DateTime.new(dateSplit[0].to_i,dateSplit[1].to_i,dateSplit[2].to_i,4,0,0).in_time_zone("Eastern Time (US & Canada)")
          Rails::logger.debug '' + p.sms_date.to_s
          p.post_date = p.sms_date
          p.sms_body = "[Blank]"
          p.kind = @type
          p.user = @user
          p.completed = false
          p.save