upsfall2011@saucers.cups.cs.cmu.edu/app/controllers/posts_controller.rb

SELECT * FROM "users" WHERE ("users"."link" = 'd98990b695b3d0ac3a8dd37a3d74be19') LIMIT 1
SELECT * FROM "posts" WHERE ("posts"."id" = 10)
---
  def index
    @user = User.find_by_link(params[:id])
    @type = params[:type]
    if @user != nil && @type != nil
      @create = params[:uc]
      if @create.casecmp("u") == 0
        @post = Post.find(params[:postid])